<?php

include "fpdf186/fpdf.php";

$pdf = new FPDF('P','mm','A4');

$pdf->AddFont('THSarabunNew','','THSarabunNew.php');
$pdf->AddFont('THSarabunNew','B','THSarabunNew_b.php');

$pdf->AddPage();

$pdf->SetFont('THSarabunNew','',16);

$pdf->Cell(10, 10, iconv('UTF-8', 'cp874', 'นฝ ....... / .......'));

$pdf->Image("assets/img/20201008132355.png", 100, 20, 18, 30);

$pdf->SetFont('THSarabunNew','',18);
$pdf->SetY(60);
$pdf->Cell(80);
$pdf->Cell(0, 0, iconv('UTF-8', 'cp874', 'ใบตอบรับนักศึกษาฝึกงาน'), 0, 'C');

$pdf->SetY(75);

$text = '                       สถาบันวิชาการป้องกันประเทศ ไม่ขัดข้อง และยินดีให้.................................................................
จาก.................................................................................เข้าฝึกงาน ณ ...................................................................
สถาบันวิชาการป้องกันประเทศ ตั้งแต่วันที่..................................................ถึงวันที่.................................................
ตามที่.........................................................................ขอความอนุเคราะห์';


$pdf->MultiCell(0, 10, iconv('UTF-8', 'cp874', $text));
$pdf->Ln();

$pdf->SetY(115);
$pdf->MultiCell(0, 10, iconv('UTF-8', 'cp874', '                       จึงเรียนมาเพื่อทราบ'));

$pdf->SetY(150);
$pdf->Cell(100);
$pdf->MultiCell(0, 10, iconv('UTF-8', 'cp874', 'พลอากาศเอก'));
$pdf->Image("assets/img/signature.JPG", 140, 145, 50, 20);

$pdf->Cell(130);
$pdf->MultiCell(0, 10, iconv('UTF-8', 'cp874', '( ภูมิใจ เลขสุนทรากร )'));
$pdf->Cell(115);
$pdf->MultiCell(0, 10, iconv('UTF-8', 'cp874', 'ผู้บัญชาการสถาบันวิชาการป้องกันประเทศ'));

$pdf->SetY(200);
$pdf->MultiCell(0, 10, iconv('UTF-8', 'cp874', 'ผู้ประการงาน'));
$pdf->MultiCell(0, 10, iconv('UTF-8', 'cp874', 'พ.อ. กานต์ โคตร์สันเทียะ'));
$pdf->MultiCell(0, 10, iconv('UTF-8', 'cp874', 'โทร ๐๘ ๑๓๔๕ ๕๓๙๗'));

$pdf->OutPut();

?>